{
    "_name_or_path": "./ckpt/llama8b-anyres",
    "architectures": ["FerretLlamaForCausalLM"],
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 128000,
    "eos_token_id": 128009,
    "freeze_mm_mlp_adapter": false,
    "hidden_act": "silu",
    "hidden_size": 4096,
    "im_region_fea_token": 128257,
    "image_aspect_ratio": "anyres",
    "image_grid_pinpoints": [
      [336, 672],
      [672, 336],
      [672, 672],
      [1008, 336],
      [336, 1008]
    ],
    "initializer_range": 0.02,
    "intermediate_size": 14336,
    "max_position_embeddings": 8192,
    "mm_hidden_size": 1024,
    "mm_patch_merge_type": "spatial",
    "mm_projector_lr": null,
    "mm_projector_type": "mlp2x_gelu",
    "mm_use_im_patch_token": false,
    "mm_use_im_start_end": false,
    "mm_vision_select_feature": "patch",
    "mm_vision_select_layer": -2,
    "mm_vision_tower": "openai/clip-vit-large-patch14-336",
    "mm_vision_tower_lr": null,
    "model_type": "ferret_llama",
    "num_attention_head": 32,
    "num_attention_heads": 32,
    "num_hidden_layers": 32,
    "num_key_value_heads": 8,
    "pad_token_id": 128256,
    "pretraining_tp": 1,
    "region_geo_sampler": true,
    "rms_norm_eps": 1e-5,
    "rope_scaling": null,
    "rope_theta": 500000.0,
    "sampler_pooler_mode": "max",
    "tie_word_embeddings": false,
    "tokenizer_model_max_length": 4096,
    "tokenizer_padding_side": "right",
    "torch_dtype": "bfloat16",
    "transformers_version": "4.39.0",
    "tune_mm_mlp_adapter": false,
    "unfreeze_mm_vision_tower": false,
    "use_cache": true,
    "use_mm_proj": true,
    "vocab_size": 128258
  }
  
  